src/effj/create_destroy_objects.org
#+TITLE: 创建和销毁对象
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: effj.html   
#+HTML_LINK_HOME: effj.html
#+OPTIONS: num:nil timestamp:nil
* 考虑使用静态工厂方法代替构造器
** 优点
1. 可以有名字
2. 可以缓存创建后的对象
3. 可以返回任何子类型对象
   #+BEGIN_SRC java
     // Service provider framework sketch
     // Service interface
     public interface Service {
             // Service-specific methods go here
     }
     // Service provider interface
     public interface Provider {
             Service newService();
     }

     // Noninstantiable class for service registration and access
     public class Services {
             private Services() { } // Prevents instantiation (Item 4)
             
             // Maps service names to services
             private static final Map<String, Provider> providers =
                     new ConcurrentHashMap<String, Provider>();

             public static final String DEFAULT_PROVIDER_NAME = "<def>";
             // Provider registration API

             public static void registerDefaultProvider(Provider p) {
                     registerProvider(DEFAULT_PROVIDER_NAME, p);
             }

             public static void registerProvider(String name, Provider p){
                     providers.put(name, p);
             }

             // Service access API,可以返回子类型
             public static Service newInstance() {
                     return newInstance(DEFAULT_PROVIDER_NAME);
             }
             public static Service newInstance(String name) {
                     Provider p = providers.get(name);
                     if (p == null)
                             throw new IllegalArgumentException(
                                     "No provider registered with name: " + name);
                     return p.newService();
             }
     }
   #+END_SRC

4. 创建参数化型实例时候代码更简洁

** 缺点
1. 如果没有public或者protected的构造器，就无法子类化。某种意义上这也是一个优点
2. 静态工厂方法本质上与其他静态方法没有区别，使用valueOf, newInstance, getInstance等命名用于静态工厂方法

* 多个构造器参数的时候考虑builder模式

