html/effj/create_destroy_objects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>创建和销毁对象</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="effj.html"> UP </a>
 |
 <a accesskey="H" href="effj.html"> HOME </a>
</div><div id="content">
<h1 class="title">创建和销毁对象</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">考虑使用静态工厂方法代替构造器</a>
<ul>
<li><a href="#sec-1-1">优点</a></li>
<li><a href="#sec-1-2">缺点</a></li>
</ul>
</li>
<li><a href="#sec-2">多个构造器参数的时候考虑builder模式</a>
<ul>
<li><a href="#sec-2-1">多个构造器</a></li>
<li><a href="#sec-2-2">Java Bean</a></li>
<li><a href="#sec-2-3">Builder模式</a></li>
</ul>
</li>
<li><a href="#sec-3">用private构造器或者enum类型强化singleton</a>
<ul>
<li><a href="#sec-3-1">使用public final成员</a></li>
<li><a href="#sec-3-2">使用static工厂方法</a></li>
<li><a href="#sec-3-3">最佳方式：使用enum</a></li>
</ul>
</li>
<li><a href="#sec-4">使用private构造器来禁止用户显式创建对象</a></li>
<li><a href="#sec-5">避免创建不必要的对象</a>
<ul>
<li><a href="#sec-5-1">重用不可变对象</a></li>
<li><a href="#sec-5-2">缓存常量</a></li>
<li><a href="#sec-5-3">优先使用基本类型，而不是装箱基本类型</a></li>
</ul>
</li>
<li><a href="#sec-6">消除过时的对象引用</a>
<ul>
<li><a href="#sec-6-1">手动管理内存中请当心内存泄漏</a></li>
<li><a href="#sec-6-2">缓存　</a></li>
<li><a href="#sec-6-3">监听器和其他回调</a></li>
</ul>
</li>
<li><a href="#sec-7">避免调用finialize方法</a>
<ul>
<li><a href="#sec-7-1">缺陷</a></li>
<li><a href="#sec-7-2">用途</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">考虑使用静态工厂方法代替构造器</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">优点</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>可以有名字
</li>
<li>可以缓存创建后的对象
</li>
<li>可以返回任何子类型对象
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Service provider framework sketch</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Service interface</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">interface</span> <span style="color: #98fb98;">Service</span> {
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Service-specific methods go here</span>
}
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Service provider interface</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">interface</span> <span style="color: #98fb98;">Provider</span> {
    <span style="color: #98fb98;">Service</span> <span style="color: #87cefa;">newService</span>();
}

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Noninstantiable class for service registration and access</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Services</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">Services</span>() { } <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Prevents instantiation (Item 4)</span>

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Maps service names to services</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Map</span>&lt;<span style="color: #98fb98;">String</span>, <span style="color: #98fb98;">Provider</span>&gt; <span style="color: #eedd82;">providers</span> =
        <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ConcurrentHashMap</span>&lt;<span style="color: #98fb98;">String</span>, <span style="color: #98fb98;">Provider</span>&gt;();

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">DEFAULT_PROVIDER_NAME</span> = <span style="color: #ffa07a;">"&lt;def&gt;"</span>;
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Provider registration API</span>

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">registerDefaultProvider</span>(<span style="color: #98fb98;">Provider</span> <span style="color: #eedd82;">p</span>) {
        registerProvider(DEFAULT_PROVIDER_NAME, p);
    }

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">registerProvider</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">name</span>, <span style="color: #98fb98;">Provider</span> <span style="color: #eedd82;">p</span>){
        providers.put(name, p);
    }

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Service access API,&#21487;&#20197;&#36820;&#22238;&#23376;&#31867;&#22411;</span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Service</span> <span style="color: #87cefa;">newInstance</span>() {
        <span style="color: #00ffff;">return</span> newInstance(DEFAULT_PROVIDER_NAME);
    }
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Service</span> <span style="color: #87cefa;">newInstance</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">name</span>) {
        <span style="color: #98fb98;">Provider</span> <span style="color: #eedd82;">p</span> = providers.get(name);
        <span style="color: #00ffff;">if</span> (p == <span style="color: #7fffd4;">null</span>)
            <span style="color: #00ffff;">throw</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">IllegalArgumentException</span>(
                <span style="color: #ffa07a;">"No provider registered with name: "</span> + name);
        <span style="color: #00ffff;">return</span> p.newService();
    }
}
</pre>
</div>
</li>

<li>创建参数化型实例时候代码更简洁
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">缺点</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>如果没有public或者protected的构造器，就无法子类化。某种意义上这也是一个优点
</li>
<li>静态工厂方法本质上与其他静态方法没有区别，使用valueOf, newInstance, getInstance等命名用于静态工厂方法
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">多个构造器参数的时候考虑builder模式</h2>
