src/effj/create_destroy_objects.org
** 多个构造器
多个构造器对应不同参数
   #+BEGIN_SRC java
     // Telescoping constructor pattern - does not scale well!
     public class NutritionFacts {
             private final int servingSize;// (mL) required
             private final int servings;// (per container) required
             private final int calories;//        optional
             private final int fat;// (g)        optional
             private final int sodium;// (mg)       optional
             private final int carbohydrate; // (g)        optional
             public NutritionFacts(int servingSize, int servings) {
                     this(servingSize, servings, 0);
             }
             public NutritionFacts(int servingSize, int servings,
                                   int calories) {
                     this(servingSize, servings, calories, 0);
             }
             public NutritionFacts(int servingSize, int servings,
                                   int calories, int fat) {
                     this(servingSize, servings, calories, fat, 0);
             }
             public NutritionFacts(int servingSize, int servings,
                                   int calories, int fat, int sodium) {
                     this(servingSize, servings, calories, fat, sodium, 0);
             }

             public NutritionFacts(int servingSize, int servings,
                                   int calories, int fat, int sodium, int carbohydrate) {
                     this.servingSize = servingSize;
                     this.servings = servings;
                     this.calories = calories;
                     this.fat = fat;
                     this.sodium = sodium;
                     this.carbohydrate = carbohydrate;
             }
     }
   #+END_SRC
客户端代码很难抉择到底使用哪个构造器，并且也不好阅读所有构造器代码
   #+BEGIN_SRC java
     NutritionFacts cocaCola =
             new NutritionFacts(240, 8, 100, 0, 35, 27);
   #+END_SRC

** Java Bean
默认空构造器，使用set方法设置相关参数
#+BEGIN_SRC java
  // JavaBeans Pattern - allows inconsistency, mandates mutability
  public class NutritionFactsBean {
  // Parameters initialized to default values (if any)
          private int servingSize = -1; // Required; no default value
          private int servings = -1;  //"　"　"　"
          private int calories = 0;
          private int fat = 0;
          private int sodium = 0;
          private int carbohydrate = 0;

          public NutritionFactsBean() {
          }

          public void setServingSize(int servingSize) {
                  this.servingSize = servingSize;
          }

          public void setServings(int servings) {
                  this.servings = servings;
          }

          public void setCalories(int calories) {
                  this.calories = calories;
          }

          public void setFat(int fat) {
                  this.fat = fat;
          }

          public void setSodium(int sodium) {
                  this.sodium = sodium;
          }

          public void setCarbohydrate(int carbohydrate) {
                  this.carbohydrate = carbohydrate;
          }
  }
#+END_SRC

客户端代码变得容易，而且易于阅读
#+BEGIN_SRC java
  NutritionFacts cocaCola = new NutritionFacts();
  cocaCola.setServingSize(240);
  cocaCola.setServings(8);
  cocaCola.setCalories(100);
  cocaCola.setSodium(35);
  cocaCola.setCarbohydrate(27);
#+END_SRC
+ 构造对象处于几个调用，需要额外维护构造过程的线程安全
+ 无法构造不可变对象，使得维护线程安全更困难

