html/effj/create_destroy_objects.html
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">多个构造器</h3>
<div class="outline-text-3" id="text-2-1">
<p>
多个构造器对应不同参数
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Telescoping constructor pattern - does not scale well!</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NutritionFacts</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>;<span style="color: #ff4500;">// </span><span style="color: #ff4500;">(mL) required</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>;<span style="color: #ff4500;">// </span><span style="color: #ff4500;">(per container) required</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>;<span style="color: #ff4500;">//        </span><span style="color: #ff4500;">optional</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>;<span style="color: #ff4500;">// </span><span style="color: #ff4500;">(g)        optional</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span>;<span style="color: #ff4500;">// </span><span style="color: #ff4500;">(mg)       optional</span>
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span>; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">(g)        optional</span>
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>) {
        <span style="color: #00ffff;">this</span>(servingSize, servings, 0);
    }
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>,
                  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>) {
        <span style="color: #00ffff;">this</span>(servingSize, servings, calories, 0);
    }
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>,
                  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>) {
        <span style="color: #00ffff;">this</span>(servingSize, servings, calories, fat, 0);
    }
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>,
                  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span>) {
        <span style="color: #00ffff;">this</span>(servingSize, servings, calories, fat, sodium, 0);
    }

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>,
                  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span>) {
        <span style="color: #00ffff;">this</span>.servingSize = servingSize;
        <span style="color: #00ffff;">this</span>.servings = servings;
        <span style="color: #00ffff;">this</span>.calories = calories;
        <span style="color: #00ffff;">this</span>.fat = fat;
        <span style="color: #00ffff;">this</span>.sodium = sodium;
        <span style="color: #00ffff;">this</span>.carbohydrate = carbohydrate;
    }
}
</pre>
</div>
<p>
客户端代码很难抉择到底使用哪个构造器，并且也不好阅读所有构造器代码
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">NutritionFacts</span> <span style="color: #eedd82;">cocaCola</span> =
    <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NutritionFacts</span>(240, 8, 100, 0, 35, 27);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Java Bean</h3>
<div class="outline-text-3" id="text-2-2">
<p>
默认空构造器，使用set方法设置相关参数
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">JavaBeans Pattern - allows inconsistency, mandates mutability</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NutritionFactsBean</span> {
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Parameters initialized to default values (if any)</span>
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span> = -1; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Required; no default value</span>
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span> = -1;  <span style="color: #ff4500;">//</span><span style="color: #ff4500;">"&#12288;"&#12288;"&#12288;"</span>
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span> = 0;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span> = 0;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span> = 0;
    <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span> = 0;

    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">NutritionFactsBean</span>() {
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setServingSize</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>) {
        <span style="color: #00ffff;">this</span>.servingSize = servingSize;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setServings</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>) {
        <span style="color: #00ffff;">this</span>.servings = servings;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setCalories</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>) {
        <span style="color: #00ffff;">this</span>.calories = calories;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setFat</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>) {
        <span style="color: #00ffff;">this</span>.fat = fat;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setSodium</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span>) {
        <span style="color: #00ffff;">this</span>.sodium = sodium;
    }

    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">setCarbohydrate</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span>) {
        <span style="color: #00ffff;">this</span>.carbohydrate = carbohydrate;
    }
}
</pre>
</div>

<p>
客户端代码变得容易，而且易于阅读
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">NutritionFacts</span> <span style="color: #eedd82;">cocaCola</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NutritionFacts</span>();
cocaCola.setServingSize(240);
cocaCola.setServings(8);
cocaCola.setCalories(100);
cocaCola.setSodium(35);
cocaCola.setCarbohydrate(27);
</pre>
</div>
<ul class="org-ul">
<li>构造对象处于几个调用，需要额外维护构造过程的线程安全
</li>
<li>无法构造不可变对象，使得维护线程安全更困难
</li>
</ul>
</div>
</div>
