src/effj/create_destroy_objects.org
** Builder模式
   #+BEGIN_SRC java
     //Builder Pattern
     public class NutritionFacts {
             private final int servingSize;
             private final int servings;
             private final int calories;
             private final int fat;
             private final int sodium;
             private final int carbohydrate;

             public static class Builder {
                     // Required parameters
                     private final int servingSize;
                     private final int servings; // Optional
                     // Optional parameters - initialized to default values
                     private int calories = 0;
                     private int fat = 0;
                     private int sodium = 0;
                     private int carbohydrate = 0;

                     public Builder(int servingSize, int servings) {
                             this.servingSize = servingSize;
                             this.servings = servings;
                     }

                     public Builder calories(int val) {
                             calories = val;
                             return this;
                     }

                     public Builder fat(int val) {
                             fat = val;
                             return this;
                     }

                     public Builder carbohydrate(int val) {
                             carbohydrate = val;
                             return this;
                     }

                     public Builder sodium(int val) {
                             sodium = val;
                             return this;
                     }

                     public NutritionFacts build() {
                             return new NutritionFacts(this);
                     }
             }

             private NutritionFacts(Builder builder) {
                     servingSize = builder.servingSize;
                     servings = builder.servings;
                     calories = builder.calories;
                     fat = builder.fat;
                     sodium = builder.sodium;
                     carbohydrate = builder.carbohydrate;
             }
     }
   #+END_SRC
cocaCola对象不可变，同样具有很好的可读性
#+BEGIN_SRC java
  public static void main(String[] args) {
          NutritionFacts cocaCola = new NutritionFacts.Builder(240, 8).
                  calories(100).sodium(35).carbohydrate(27).build();
          System.out.print("built " + cocaCola);
  }
#+END_SRC
构造器模式的缺点：代码非常冗长，阅读很困难，构造开销大。所以只有很多参数时候才考虑使用

* 用private构造器或者enum类型强化singleton
** 使用public final成员
   #+BEGIN_SRC java
     // Singleton with public final field
     public class Elvis {
             public static final Elvis INSTANCE = new Elvis();
             private Elvis() { ... }
             public void leaveTheBuilding() { ... }
     }
   #+END_SRC

** 使用static工厂方法
   #+BEGIN_SRC java
     // Singleton with static factory
     public class Elvis {
             private static final Elvis INSTANCE = new Elvis();
             private Elvis() { ... }
             public static Elvis getInstance() { return INSTANCE; }
             public void leaveTheBuilding() { ... }
     }
   #+END_SRC
+ 未考虑多线程
+ 序列化需要注意：必须覆写readResolve来保证singleton
  #+BEGIN_SRC java
    // readResolve method to preserve singleton property
    private Object readResolve() {
    // Return the one true Elvis and let the garbage collector
    // take care of the Elvis impersonator.
            return INSTANCE;
    }
  #+END_SRC
** 最佳方式：使用enum
   #+BEGIN_SRC java
     // Enum singleton - the preferred approach
     public enum Elvis {
             INSTANCE;
             public void leaveTheBuilding() { ... }
     }
   #+END_SRC
* 使用private构造器来禁止用户显式创建对象
私有构造器可以禁止用户创建对像，副作用也禁止用户继承这个类
* 避免创建不必要的对象
** 重用不可变对象
  #+BEGIN_SRC java
    // DON'T DO THIS!
    String s = new String("stringette");
  #+END_SRC

  #+BEGIN_SRC java
    //improved version
    String s = "stringette";
  #+END_SRC
