html/effj/create_destroy_objects.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Builder模式</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">Builder Pattern</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">NutritionFacts</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span>;
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span>;

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Builder</span> {
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Required parameters</span>
        <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>;
        <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Optional</span>
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Optional parameters - initialized to default values</span>
        <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">calories</span> = 0;
        <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">fat</span> = 0;
        <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">sodium</span> = 0;
        <span style="color: #00ffff;">private</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">carbohydrate</span> = 0;

        <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">Builder</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servingSize</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">servings</span>) {
            <span style="color: #00ffff;">this</span>.servingSize = servingSize;
            <span style="color: #00ffff;">this</span>.servings = servings;
        }

        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Builder</span> <span style="color: #87cefa;">calories</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">val</span>) {
            calories = val;
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">this</span>;
        }

        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Builder</span> <span style="color: #87cefa;">fat</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">val</span>) {
            fat = val;
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">this</span>;
        }

        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Builder</span> <span style="color: #87cefa;">carbohydrate</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">val</span>) {
            carbohydrate = val;
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">this</span>;
        }

        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Builder</span> <span style="color: #87cefa;">sodium</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">val</span>) {
            sodium = val;
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">this</span>;
        }

        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">NutritionFacts</span> <span style="color: #87cefa;">build</span>() {
            <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">NutritionFacts</span>(<span style="color: #00ffff;">this</span>);
        }
    }

    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">NutritionFacts</span>(<span style="color: #98fb98;">Builder</span> <span style="color: #eedd82;">builder</span>) {
        servingSize = builder.servingSize;
        servings = builder.servings;
        calories = builder.calories;
        fat = builder.fat;
        sodium = builder.sodium;
        carbohydrate = builder.carbohydrate;
    }
}
</pre>
</div>
<p>
cocaCola对象不可变，同样具有很好的可读性
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
    <span style="color: #98fb98;">NutritionFacts</span> <span style="color: #eedd82;">cocaCola</span> = <span style="color: #00ffff;">new</span> <span style="color: #7fffd4;">NutritionFacts</span>.<span style="color: #98fb98;">Builder</span>(240, 8).
        calories(100).sodium(35).carbohydrate(27).build();
    System.out.print(<span style="color: #ffa07a;">"built "</span> + cocaCola);
}
</pre>
</div>
<p>
构造器模式的缺点：代码非常冗长，阅读很困难，构造开销大。所以只有很多参数时候才考虑使用
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">用private构造器或者enum类型强化singleton</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">使用public final成员</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Singleton with public final field</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Elvis</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Elvis</span> <span style="color: #eedd82;">INSTANCE</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Elvis</span>();
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">Elvis</span>() { ... }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">leaveTheBuilding</span>() { ... }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">使用static工厂方法</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Singleton with static factory</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Elvis</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Elvis</span> <span style="color: #eedd82;">INSTANCE</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Elvis</span>();
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">Elvis</span>() { ... }
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Elvis</span> <span style="color: #87cefa;">getInstance</span>() { <span style="color: #00ffff;">return</span> INSTANCE; }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">leaveTheBuilding</span>() { ... }
}
</pre>
</div>
<ul class="org-ul">
<li>未考虑多线程
</li>
<li>序列化需要注意：必须覆写readResolve来保证singleton
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">readResolve method to preserve singleton property</span>
<span style="color: #00ffff;">private</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">readResolve</span>() {
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Return the one true Elvis and let the garbage collector</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">take care of the Elvis impersonator.</span>
    <span style="color: #00ffff;">return</span> INSTANCE;
}
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">最佳方式：使用enum</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Enum singleton - the preferred approach</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">Elvis</span> {
    <span style="color: #eedd82;">INSTANCE</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #eedd82;">leaveTheBuilding</span>() { ... }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">使用private构造器来禁止用户显式创建对象</h2>
<div class="outline-text-2" id="text-4">
<p>
私有构造器可以禁止用户创建对像，副作用也禁止用户继承这个类
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">避免创建不必要的对象</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">重用不可变对象</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">DON'T DO THIS!</span>
<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">s</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">String</span>(<span style="color: #ffa07a;">"stringette"</span>);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">improved version</span>
<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">s</span> = <span style="color: #ffa07a;">"stringette"</span>;
</pre>
</div>
</div>
</div>
